{
  "_name_or_path": "MCG-NJU/videomae-base",
  "architectures": [
    "VideoMAEForVideoClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 384,
  "decoder_intermediate_size": 1536,
  "decoder_num_attention_heads": 6,
  "decoder_num_hidden_layers": 4,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "BaseballPitch",
    "1": "Basketball",
    "2": "BenchPress",
    "3": "Biking",
    "4": "Billiards",
    "5": "BreastStroke",
    "6": "CleanAndJerk",
    "7": "Diving",
    "8": "Drumming",
    "9": "Fencing",
    "10": "GolfSwing",
    "11": "HighJump",
    "12": "HorseRace",
    "13": "HorseRiding",
    "14": "HulaHoop",
    "15": "JavelinThrow",
    "16": "JugglingBalls",
    "17": "JumpRope",
    "18": "JumpingJack",
    "19": "Kayaking",
    "20": "Lunges",
    "21": "MilitaryParade",
    "22": "Mixing",
    "23": "Nunchucks",
    "24": "PizzaTossing",
    "25": "PlayingGuitar",
    "26": "PlayingPiano",
    "27": "PlayingTabla",
    "28": "PlayingViolin",
    "29": "PoleVault",
    "30": "PommelHorse",
    "31": "PullUps",
    "32": "Punch",
    "33": "PushUps",
    "34": "RockClimbingIndoor",
    "35": "RopeClimbing",
    "36": "Rowing",
    "37": "SalsaSpin",
    "38": "SkateBoarding",
    "39": "Skiing",
    "40": "Skijet",
    "41": "SoccerJuggling",
    "42": "Swing",
    "43": "TaiChi",
    "44": "TennisSwing",
    "45": "ThrowDiscus",
    "46": "TrampolineJumping",
    "47": "VolleyballSpiking",
    "48": "WalkingWithDog",
    "49": "YoYo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "BaseballPitch": 0,
    "Basketball": 1,
    "BenchPress": 2,
    "Biking": 3,
    "Billiards": 4,
    "BreastStroke": 5,
    "CleanAndJerk": 6,
    "Diving": 7,
    "Drumming": 8,
    "Fencing": 9,
    "GolfSwing": 10,
    "HighJump": 11,
    "HorseRace": 12,
    "HorseRiding": 13,
    "HulaHoop": 14,
    "JavelinThrow": 15,
    "JugglingBalls": 16,
    "JumpRope": 17,
    "JumpingJack": 18,
    "Kayaking": 19,
    "Lunges": 20,
    "MilitaryParade": 21,
    "Mixing": 22,
    "Nunchucks": 23,
    "PizzaTossing": 24,
    "PlayingGuitar": 25,
    "PlayingPiano": 26,
    "PlayingTabla": 27,
    "PlayingViolin": 28,
    "PoleVault": 29,
    "PommelHorse": 30,
    "PullUps": 31,
    "Punch": 32,
    "PushUps": 33,
    "RockClimbingIndoor": 34,
    "RopeClimbing": 35,
    "Rowing": 36,
    "SalsaSpin": 37,
    "SkateBoarding": 38,
    "Skiing": 39,
    "Skijet": 40,
    "SoccerJuggling": 41,
    "Swing": 42,
    "TaiChi": 43,
    "TennisSwing": 44,
    "ThrowDiscus": 45,
    "TrampolineJumping": 46,
    "VolleyballSpiking": 47,
    "WalkingWithDog": 48,
    "YoYo": 49
  },
  "layer_norm_eps": 1e-12,
  "model_type": "videomae",
  "norm_pix_loss": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.2",
  "tubelet_size": 2,
  "use_mean_pooling": false
}
